Tekla Open API Reference for Tekla Structures 2025
Grid.GridAttributes.OffsetAtEndOfLine Property
 The offset for the end of the grid lines.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double OffsetAtEndOfLine { get; set; }
Public Property OffsetAtEndOfLine As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Grid.GridAttributes Class
Tekla.Structures.Drawing Namespace